#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.discord_simde.discord_role.zapier has changed
  ~ resource "discord_role" "zapier" {
        id          = "791043844132962315"
        name        = "Zapier"
      ~ permissions = 637567040 -> 32832
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_text_channel.games has changed
  ~ resource "discord_text_channel" "games" {
        id                       = "781925726840553514"
        name                     = "clashofcode-and-cie"
      ~ sync_perms_with_category = true -> false
        # (5 unchanged attributes hidden)
    }

  # module.github.github_repository.utc_mobile has changed
  ~ resource "github_repository" "utc_mobile" {
      ~ etag                   = "W/\"65b5f0d65a88eca117700f0840aaef69270c6a7a8a3e768c775e1072fdc7c978\"" -> "W/\"6e02f3ea22e9fbbc7dba01b581975176cfccd479dcac695419f3e464663b63c6\""
        id                     = "utc-mobile"
        name                   = "utc-mobile"
        # (25 unchanged attributes hidden)
    }

  # module.github.github_team_repository.application_utcbde_utc_mobile has changed
  ~ resource "github_team_repository" "application_utcbde_utc_mobile" {
      ~ etag       = "W/\"e713e271c699bd561c33a497b5b41db343513fb08b5836081a3acfbc4f8de672\"" -> "W/\"e9dee1c599491c59c36ab76fcbb0e623f68490340dacd690f82a7e355ebf6727\""
        id         = "3158184:utc-mobile"
        # (3 unchanged attributes hidden)
    }

  # module.github.github_team_repository.portail_utc_mobile has changed
  ~ resource "github_team_repository" "portail_utc_mobile" {
      ~ etag       = "W/\"e713e271c699bd561c33a497b5b41db343513fb08b5836081a3acfbc4f8de672\"" -> "W/\"e9dee1c599491c59c36ab76fcbb0e623f68490340dacd690f82a7e355ebf6727\""
        id         = "3158212:utc-mobile"
        # (3 unchanged attributes hidden)
    }

  # module.github.github_team_repository.simde_terraform has changed
  ~ resource "github_team_repository" "simde_terraform" {
      ~ etag       = "W/\"be78b4c50824f754c73d296e8f58242b0ca9b5c6deeda84f12a6297bd80d32d0\"" -> "W/\"360229b0ba8c9acadce47624396ed2d85435e73cfc812853e5488540f2864fa9\""
        id         = "4217733:terraform"
        # (3 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_branch_protection_v3.uvweb_master has changed
  ~ resource "github_branch_protection_v3" "uvweb_master" {
        id                     = "uvweb:master"
        # (5 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          + dismissal_users                 = []
            # (5 unchanged attributes hidden)
        }


      ~ restrictions {
          + apps  = []
          + users = []
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.discord_simde.discord_channel_permission.everyone_games will be updated in-place
  ~ resource "discord_channel_permission" "everyone_games" {
      ~ allow        = 0 -> 103924288
      ~ deny         = 0 -> 197889
        id           = "1359208525"
        # (3 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.zapier will be updated in-place
  ~ resource "discord_role" "zapier" {
        id          = "791043844132962315"
        name        = "Zapier"
      ~ permissions = 32832 -> 637567040
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_text_channel.games will be updated in-place
  ~ resource "discord_text_channel" "games" {
        id                       = "781925726840553514"
        name                     = "clashofcode-and-cie"
      ~ sync_perms_with_category = false -> true
        # (5 unchanged attributes hidden)
    }

  # module.github.github_team.uvweb will be created
  + resource "github_team" "uvweb" {
      + create_default_maintainer = false
      + description               = "Développer la nouvelle version de UVWeb"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "UVWeb"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.github.module.armand_ribault.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "armribdev"
    }

  # module.github.module.armand_ribault.github_team_membership.membership["flairsou"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "armribdev"
    }

Plan: 3 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*